
public class Card {
	//속성
	//멤버변수(자동초기화): 인스턴스 변수 - int age
	//                클래스(스태틱)변수   - static int size
	//                                특징:필요에 따라서 선언과 동시에 초기화 한다.
	//                                객체생성없이 사용 가능하다.(알아서 생성된다.)
	//                                *공유되어진다.*  => 메모리에 각각  할당해서 사용하는게 아니라 딱 한번으로 할당되어지고 창조할 때,같은 데이터를 쓴다.
	//                                 c1->iv  c2->iv  ->   c1,c2->cv
	     
	
	
	
//	int iv;              //멤버변수
//	static int cv = 100; //static 변수는 값을 초기화 해서 사용한다.
	
//	void channel() {
//		int x;  //지역변수(강제초기화)
//	}
	
	//1.카드의 속성
	//속성 : 숫자,모양,크기(높이와너비),.....
//	int number;
//	String kind;
//	static int height = 100; //스태틱한변수로 바꿔주면 불필요한 메모리 사용이 줄어든다.
//	static int width = 80;   //크기가 동일하기 위해 높이와 너비는 같아야 하므로 스태틱으로 공유 시켜준다.
	
	
	


}
